<!DOCTYPE html>
<html lang="ru">

<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="stylesheet" href="/css/styles.css">
  <link rel="stylesheet" href="/css/animation.css">
  <link rel="stylesheet" href="/css/fontello.css">

  <script src="/js/jquery.js"></script>
  <title>Document</title>
</head>

<body>
  <header>
    <div class="container">
      <div class="lang"><a href="/ru" class="active">Ru</a> <a href="/en">En</a></div>
      <div class="header_inner">
        <picture>
          <source type="image/webp" srcset="images/logo.webp x1" media="(max-width: 768px)">
          <source type="image/webp" srcset="images/logo@2.webp x2" media="(min-width: 768px)">
          <img src="images/logo.png" srcset="images/logo@2.png x2" alt="" class="logo">
        </picture>
        <p>Гибкая мобильная платформа для быстрой реализации инвестиционных сервисов. </p>
        <button>Заказать демо</button>
      </div>
      <div class="properties">
        <div>
          <p>Удобный пользовательский интерфейс</p>

          <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M19.5833 39.1667C30.3989 39.1667 39.1667 30.3989 39.1667 19.5833C39.1667 8.76776 30.3989 0 19.5833 0C8.76776 0 0 8.76776 0 19.5833C0 30.3989 8.76776 39.1667 19.5833 39.1667Z" fill="#EFF9FF" />
            <path fill-rule="evenodd" clip-rule="evenodd" d="M22.423 9.00105C22.0474 8.98661 21.6739 9.12156 21.3925 9.37643C21.1684 9.57938 21.0162 9.84619 20.957 10.1382L20.9349 10.303L20.9299 10.4491L21.3741 16.9735C21.4295 17.8051 22.1615 18.4382 23.0133 18.39L29.6588 17.9567C30.0477 17.9286 30.4041 17.7524 30.6545 17.4668C30.8538 17.2393 30.9737 16.9562 30.9977 16.6585L31 16.4567L30.9904 16.3408C30.3029 12.2016 26.7085 9.12227 22.423 9.00105ZM22.4113 10.449L22.6287 10.4593C26.0119 10.6644 28.8318 13.0802 29.4854 16.3335L29.5182 16.5135L22.9214 16.945C22.888 16.9469 22.8537 16.9172 22.8511 16.8781L22.4113 10.449ZM17.7814 12.8453C18.502 12.7468 19.211 13.1245 19.4978 13.7606C19.5855 13.9348 19.6382 14.1239 19.6533 14.321L20.0419 19.8095C20.0471 19.8847 20.0827 19.9548 20.1409 20.0042C20.1845 20.0413 20.2381 20.0645 20.298 20.0712L20.3599 20.0724L25.9341 19.7366C26.3867 19.71 26.8305 19.8675 27.1604 20.1719C27.4902 20.4763 27.6768 20.9004 27.6744 21.3912C27.4265 25.0037 24.773 28.0237 21.159 28.8065C17.545 29.5893 13.8361 27.9474 12.0578 24.7848C11.5823 23.9695 11.2618 23.0778 11.1138 22.1749L11.0664 21.8359C11.0253 21.5821 11.0032 21.3257 11 21.0795L11.0031 20.8372C11.0134 17.0655 13.6616 13.804 17.3881 12.9243L17.6438 12.8681L17.7814 12.8453ZM18.0164 14.2781L17.9322 14.2877L17.7037 14.3393C14.7353 15.0548 12.6062 17.6103 12.488 20.621L12.4828 20.8661C12.4757 21.0525 12.4825 21.2392 12.505 21.4378L12.5328 21.6408C12.6321 22.495 12.9079 23.3206 13.3491 24.0772C14.8163 26.6863 17.8667 28.0367 20.839 27.3929C23.8113 26.7491 25.9936 24.2653 26.1958 21.3414C26.1959 21.2974 26.1774 21.2552 26.1446 21.225C26.1228 21.2049 26.0959 21.1912 26.0675 21.1851L26.024 21.1817L20.459 21.5169C19.9894 21.5503 19.5255 21.3992 19.17 21.0971C18.8146 20.7951 18.5968 20.3669 18.5652 19.91L18.177 14.4262C18.1763 14.4171 18.1739 14.4082 18.1568 14.373C18.1315 14.3169 18.0765 14.2813 18.0164 14.2781Z" fill="#0962E8" />
          </svg>

        </div>
        <div>
          <p>Панель
            администратора
            для ведения учета
          </p>

          <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M19.5833 39.1667C30.3989 39.1667 39.1667 30.3989 39.1667 19.5833C39.1667 8.76776 30.3989 0 19.5833 0C8.76776 0 0 8.76776 0 19.5833C0 30.3989 8.76776 39.1667 19.5833 39.1667Z" fill="#EFF9FF" />
            <path fill-rule="evenodd" clip-rule="evenodd" d="M24.8212 11.5814C24.8212 10.1557 25.9805 9 27.4106 9C28.8407 9 30 10.1557 30 11.5814C30 13.007 28.8407 14.1628 27.4106 14.1628C25.9805 14.1628 24.8212 13.007 24.8212 11.5814ZM28.5465 11.5814C28.5465 10.956 28.0379 10.449 27.4106 10.449C26.7833 10.449 26.2747 10.956 26.2747 11.5814C26.2747 12.2068 26.7833 12.7137 27.4106 12.7137C28.0379 12.7137 28.5465 12.2068 28.5465 11.5814ZM23.5277 16.5402C23.7736 16.2239 24.2301 16.1662 24.5473 16.4113C24.8358 16.6341 24.9099 17.0304 24.7363 17.3383L24.6767 17.4277L21.8384 21.0796C21.6139 21.3685 21.2139 21.4415 20.9047 21.2658L20.815 21.2056L18.0835 19.0668L15.6312 22.2448C15.4086 22.5331 15.0113 22.6083 14.7019 22.4363L14.612 22.3772C14.3228 22.1554 14.2474 21.7593 14.4199 21.4508L14.4792 21.3612L17.3795 17.6032C17.6036 17.3129 18.0046 17.239 18.3145 17.415L18.4045 17.4753L21.1368 19.6155L23.5277 16.5402ZM23.2236 10.538C23.2236 10.1379 22.8982 9.81348 22.4968 9.81348H15.4543L15.2273 9.81726C12.0752 9.92283 10 12.2306 10 15.5073V23.315L10.0035 23.5481C10.1006 26.7878 12.2269 29 15.4543 29H23.7918L24.0188 28.9962C27.1721 28.891 29.2461 26.5901 29.2461 23.315V16.5153L29.2394 16.417C29.1913 16.0634 28.8872 15.7908 28.5193 15.7908C28.1179 15.7908 27.7926 16.1152 27.7926 16.5153V23.315L27.7886 23.5399C27.7007 25.9868 26.1725 27.551 23.7918 27.551H15.4543L15.2384 27.5467C12.891 27.4534 11.4535 25.8291 11.4535 23.315V15.5073L11.4575 15.2822C11.5455 12.8328 13.0757 11.2625 15.4543 11.2625H22.4968L22.5954 11.2559C22.9502 11.2079 23.2236 10.9048 23.2236 10.538Z" fill="#0962E8" />
          </svg>

        </div>
        <div>
          <p>Простая и&nbsp;быстрая
            интеграция</p>

          <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M19.5833 39.1667C30.3989 39.1667 39.1667 30.3989 39.1667 19.5833C39.1667 8.76776 30.3989 0 19.5833 0C8.76776 0 0 8.76776 0 19.5833C0 30.3989 8.76776 39.1667 19.5833 39.1667Z" fill="#EFF9FF" />
            <path fill-rule="evenodd" clip-rule="evenodd" d="M13.9494 11.5C11.7684 11.5 10 13.2632 10 15.4371C10 17.6102 11.7686 19.3732 13.9494 19.3732C16.1303 19.3732 17.8989 17.6102 17.8989 15.4371C17.8989 13.2632 16.1305 11.5 13.9494 11.5ZM13.9494 13.0074C15.295 13.0074 16.3863 14.0956 16.3863 15.4371C16.3863 16.7777 15.2949 17.8658 13.9494 17.8658C12.604 17.8658 11.5126 16.7777 11.5126 15.4371C11.5126 14.0956 12.6039 13.0074 13.9494 13.0074ZM29.9997 15.4371C29.9997 15.0209 29.6611 14.6834 29.2434 14.6834H21.5652L21.4626 14.6903C21.0935 14.7402 20.8089 15.0556 20.8089 15.4371C20.8089 15.8534 21.1475 16.1908 21.5652 16.1908H29.2434L29.346 16.184C29.7151 16.1341 29.9997 15.8187 29.9997 15.4371ZM22.1011 26.564C22.1011 24.3902 23.8693 22.628 26.0506 22.628C28.2318 22.628 30 24.3902 30 26.564C30 28.7378 28.2318 30.5 26.0506 30.5C23.8693 30.5 22.1011 28.7378 22.1011 26.564ZM28.4874 26.564C28.4874 25.2227 27.3964 24.1354 26.0506 24.1354C24.7047 24.1354 23.6137 25.2227 23.6137 26.564C23.6137 27.9052 24.7047 28.9926 26.0506 28.9926C27.3964 28.9926 28.4874 27.9052 28.4874 26.564ZM19.1912 26.564C19.1912 26.1477 18.8526 25.8103 18.4349 25.8103H10.7567L10.6541 25.8171C10.285 25.8671 10.0004 26.1824 10.0004 26.564C10.0004 26.9802 10.339 27.3177 10.7567 27.3177H18.4349L18.5375 27.3108C18.9067 27.2609 19.1912 26.9455 19.1912 26.564Z" fill="#0962E8" />
          </svg>

        </div>
        <div>
          <p>Гибкая масштабируемая
            система
          </p>
          <div>
            <i class="icon icon-cog">&#xe801;</i>
          </div>
          

        </div>
      </div>
    </div>

  </header>

  <main>
    <div class="container">
      <h1>Наши <span>ключевые продукты</span> <br> для инвестиций</h1>
      <div class="products">
        <div class="product">
          <div class="product_desc">
            <h3>Платформа для автоследования</h3>
            <p>Копирование стратегий в&nbsp;автономном режиме</p>
          </div>
          <div class="product_image">
            <picture>
              <source type="image/webp" srcset="images/risk_level_1.webp x1" media="(max-width: 768px)">
              <source type="image/webp" srcset="images/risk_level_1@2.webp x2" media="(min-width: 768px)">
              <img src="images/risk_level_1.png" srcset="images/risk_level_1@2.png x2" alt="">
            </picture>
          </div>
        </div>
        <div class="product">
          <div class="product_desc">
            <h3>Платформа для робо-эдвайзинга</h3>
            <p>Персонализированный подбор стратегий исходя из заданных параметров</p>
          </div>
          <div class="product_image">
            <picture>
              <source type="image/webp" srcset="images/risk_level_2.webp x1" media="(max-width: 768px)">
              <source type="image/webp" srcset="images/risk_level_2@2.webp x2" media="(min-width: 768px)">
              <img src="images/risk_level_2.png" srcset="images/risk_level_2@2.png x2" alt="">
            </picture>
          </div>
        </div>
      </div>

      <div class="benefits">
        <div class="ben_desc">
          <h1><span>Представляем ценность</span> для броĸера и банĸа</h1>
          <p>Мы&nbsp;помогаем броĸерам и&nbsp;банĸам запустить собственное мобильное приложение для инвестиций в ĸоротĸие сроĸи и&nbsp;с&nbsp;эĸономией бюджета</p>
          <button>Заказать демо</button>
        </div>
        <div class="ben_items">
          <div class="benefit">

            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_1_42)">
                <path d="M20.4167 40C31.2323 40 40 31.2323 40 20.4167C40 9.60113 31.2323 0.833374 20.4167 0.833374C9.6011 0.833374 0.833344 9.60113 0.833344 20.4167C0.833344 31.2323 9.6011 40 20.4167 40Z" fill="#EFF9FF" />
                <path d="M9.16668 9.16671C13.769 9.16671 17.5 7.30122 17.5 5.00004C17.5 2.69886 13.769 0.833374 9.16668 0.833374C4.5643 0.833374 0.833344 2.69886 0.833344 5.00004C0.833344 7.30122 4.5643 9.16671 9.16668 9.16671Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M0.833344 5C0.833344 5 0.833344 8.53217 0.833344 10.8333C0.833344 13.1345 4.5643 15 9.16668 15C13.769 15 17.5 13.1345 17.5 10.8333C17.5 9.47033 17.5 5 17.5 5" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M0.833344 10.8334C0.833344 10.8334 0.833344 14.3655 0.833344 16.6667C0.833344 18.9679 4.5643 20.8334 9.16668 20.8334C13.769 20.8334 17.5 18.9679 17.5 16.6667C17.5 15.3037 17.5 10.8334 17.5 10.8334" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M0.833344 16.6666C0.833344 16.6666 0.833344 20.1988 0.833344 22.5C0.833344 24.8011 4.5643 26.6666 9.16668 26.6666C13.769 26.6666 17.5 24.8011 17.5 22.5C17.5 21.137 17.5 16.6666 17.5 16.6666" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M0.833344 22.5C0.833344 22.5 0.833344 26.0322 0.833344 28.3333C0.833344 30.6345 4.5643 32.5 9.16668 32.5C13.769 32.5 17.5 30.6345 17.5 28.3333C17.5 26.9703 17.5 22.5 17.5 22.5" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M25.8333 20.8333C30.4357 20.8333 34.1667 18.9678 34.1667 16.6667C34.1667 14.3655 30.4357 12.5 25.8333 12.5C21.231 12.5 17.5 14.3655 17.5 16.6667C17.5 18.9678 21.231 20.8333 25.8333 20.8333Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M17.5 16.6666C17.5 16.6666 17.5 20.1988 17.5 22.5C17.5 24.8011 21.231 26.6666 25.8333 26.6666C30.4357 26.6666 34.1667 24.8011 34.1667 22.5C34.1667 21.137 34.1667 16.6666 34.1667 16.6666" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M17.5 22.5C17.5 22.5 17.5 26.0322 17.5 28.3333C17.5 30.6345 21.231 32.5 25.8333 32.5C30.4357 32.5 34.1667 30.6345 34.1667 28.3333C34.1667 26.9703 34.1667 22.5 34.1667 22.5" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
              </g>
              <defs>
                <clipPath id="clip0_1_42">
                  <rect width="40" height="40" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <p>Эĸономим время и&nbsp;деньги
              на&nbsp;запусĸ digital сервисов</p>
          </div>
          <div class="benefit">

            <svg width="40" height="38" viewBox="0 0 40 38" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_1_57)">
                <path d="M21.2 37.6C31.583 37.6 40 29.183 40 18.8C40 8.41705 31.583 0 21.2 0C10.8171 0 2.40002 8.41705 2.40002 18.8C2.40002 29.183 10.8171 37.6 21.2 37.6Z" fill="#EFF9FF" />
                <path d="M16.8 8.80005C19.0091 8.80005 20.8 7.00917 20.8 4.80005C20.8 2.59091 19.0091 0.800049 16.8 0.800049C14.5909 0.800049 12.8 2.59091 12.8 4.80005C12.8 7.00917 14.5909 8.80005 16.8 8.80005Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M19.2 13.6H14.4C13.6571 13.6 13.2856 13.6 12.9727 13.6308C9.93409 13.9301 7.53009 16.3341 7.23081 19.3727C7.20001 19.6856 7.20001 20.057 7.20001 20.8H26.4C26.4 20.057 26.4 19.6856 26.3692 19.3727C26.0699 16.3341 23.6659 13.9301 20.6273 13.6308C20.3144 13.6 19.943 13.6 19.2 13.6Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M30.4 19.0273C31.9213 20.0067 32.8 21.1625 32.8 22.4004C32.8 25.935 25.6365 28.8004 16.8 28.8004C7.96343 28.8004 0.799988 25.935 0.799988 22.4004C0.799988 21.1625 1.6786 20.0067 3.19999 19.0273" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M12.8 24.8L16.8 28.8L12.8 32.8001" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
              </g>
              <defs>
                <clipPath id="clip0_1_57">
                  <rect width="40" height="37.6" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <p>Создаем канал привлечения новых клиентов</p>
          </div>
          <div class="benefit">

            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_1_34)">
                <path d="M20.4167 40C31.2323 40 40 31.2323 40 20.4167C40 9.60113 31.2323 0.833374 20.4167 0.833374C9.6011 0.833374 0.833344 9.60113 0.833344 20.4167C0.833344 31.2323 9.6011 40 20.4167 40Z" fill="#EFF9FF" />
                <path d="M8.92801 14.643C12.0839 14.643 14.6423 12.0847 14.6423 8.92879C14.6423 5.77285 12.0839 3.21448 8.92801 3.21448C5.77208 3.21448 3.21371 5.77285 3.21371 8.92879C3.21371 12.0847 5.77208 14.643 8.92801 14.643Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M26.0707 31.7858C29.2267 31.7858 31.785 29.2273 31.785 26.0715C31.785 22.9156 29.2267 20.3572 26.0707 20.3572C22.9148 20.3572 20.3564 22.9156 20.3564 26.0715C20.3564 29.2273 22.9148 31.7858 26.0707 31.7858Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M17.5 34.1667C8.29528 34.1667 0.833344 26.7048 0.833344 17.5L6.38886 20.2778" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M17.5 0.833374C26.7048 0.833374 34.1667 8.29526 34.1667 17.5L28.6111 14.7223" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
              </g>
              <defs>
                <clipPath id="clip0_1_34">
                  <rect width="40" height="40" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <p>Помогаем увеличить выручку путем запуска нового продукта</p>
          </div>
          <div class="benefit">

            <svg width="40" height="41" viewBox="0 0 40 41" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_1_52)">
                <path d="M20.4166 40.8333C31.2322 40.8333 40 32.0655 40 21.25C40 10.4344 31.2322 1.66663 20.4166 1.66663C9.60107 1.66663 0.833313 10.4344 0.833313 21.25C0.833313 32.0655 9.60107 40.8333 20.4166 40.8333Z" fill="#EFF9FF" />
                <path d="M17.5 12.5C20.7217 12.5 23.3334 9.88837 23.3334 6.66671C23.3334 3.44505 20.7217 0.833374 17.5 0.833374C14.2784 0.833374 11.6667 3.44505 11.6667 6.66671C11.6667 9.88837 14.2784 12.5 17.5 12.5Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M0.833313 31.6667C0.833313 24.3029 7.54906 18.3334 15.8333 18.3334" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
                <path d="M24.0416 20.8334C22.2697 20.8334 20.8333 22.5072 20.8333 24.572C20.8333 28.3106 24.625 31.7095 26.6666 32.5C28.7083 31.7095 32.5 28.3106 32.5 24.572C32.5 22.5072 31.0636 20.8334 29.2916 20.8334C28.2066 20.8334 27.2472 21.4611 26.6666 22.4219C26.0861 21.4611 25.1267 20.8334 24.0416 20.8334Z" stroke="#0962E8" stroke-linecap="round" stroke-linejoin="round" />
              </g>
              <defs>
                <clipPath id="clip0_1_52">
                  <rect width="40" height="40.8333" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <p>Повышаем лояльность действующих клиентов</p>
          </div>
        </div>
      </div>
    </div>

  </main>
  <footer>
    <div class="container">
      <?php
      $data = unserialize($_COOKIE['user'], ["allowed_classes" => false]);
      // print_r($data)
      ?>
      <div class="alert" style="display:none">
        <p class='success'>Поздравляем, вы прошли авторизацию!</p>
      </div>
      <div class="login-form" style="<?= (!$data) ? '' : 'display:none'; ?>">
        <div>
          <label>Username</label>
          <input type="text" name="username" class="username" pattern="[a-zA-Z0-9]+" required />
        </div>

        <div>
          <label>Password</label>
          <input type="password" name="password" class="password" required />
        </div>
      </div>
      <div class="card product" style="<?= ($data) ? '' : 'display:none'; ?>">
        <div class="product_desc">
          <h3 class="name"><?= $data['name'] ?></h3>
          <span class="birth_date"><?= $data['birth_date'] ?></span>
        </div>
        <div class="product_image">
          <img src="<?= $data['photo'] ?>" alt="avatar" class="avatar" width="100">

        </div>
        <div>

        </div>

      </div>
      <button type="submit" name="login" value="login" class="login">Log <?= (!$data) ? 'in' : 'out'; ?></button>
    </div>

  </footer>


  <script>
    $(document).ready(function() {
      $('button.login').on('click', function() {
        let username_val = $('input.username').val();
        let password_val = $('input.password').val();
        $.ajax({
            method: "POST",
            url: "login.php",
            dataType: "json",
            data: {
              username: username_val,
              password: password_val
            }
          })
          .done(function(response) {
            console.log(response);
            if (response == 0) {
              $('.card').hide();
              $('.login-form').show();
              $('.login').text('Login');
            } else if (response == -1) {
              $('.alert').html("<p class='error'> Неверные пароль или имя пользователя!</p>").show();
              setTimeout(function() {
                $('.alert').hide();
              }, 10000);
            } else {
              $('.alert').html("<p class='success'>Поздравляем, вы прошли авторизацию!</p>").show();
              setTimeout(function() {
                $('.alert').hide();
              }, 10000);
              $('.avatar').attr('src', response['photo']);
              $('.name').text(response['name']);
              $('.birth_date').text(response['birth_date']);
              $('.card').show();
              $('.login-form').hide();
              $('.login').text('Logout');
              $("input.username").val('');
              $("input.password").val('');
            }
          });
      })
    })
  </script>
</body>

</html>